In [175]:
import pandas as pd
import numpy as np

# Series

Series is a collection of data that has particular position.

In [176]:
a = pd.Series([1, 2, 3, 4, 5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [177]:
print(a.values)
print(a.index)

[1 2 3 4 5]
RangeIndex(start=0, stop=5, step=1)

In [178]:
# Lets create a series of marks of dofferent students
marks = pd.Series([9, 8, 9, 7, 5], index=['Clarke', 'John', 'Mathew', 
                                          'Lily', 'Rose'])
marks

Clarke    9
John      8
Mathew    9
Lily      7
Rose      5
dtype: int64

In [179]:
marks['Lily']

7

Series acts like a dictionary

In [180]:
# Conditions on series
marks[marks > 7]

Clarke    9
John      8
Mathew    9
dtype: int64

In [181]:
# Converting a series into dictionary
dictt = marks.to_dict()
dictt

{'Clarke': 9, 'John': 8, 'Lily': 7, 'Mathew': 9, 'Rose': 5}

In [182]:
# Converting a dictionary into Series
dictt = pd.Series(dictt)
dictt

Clarke    9
John      8
Mathew    9
Lily      7
Rose      5
dtype: int64

In [183]:
# Finding Nan value
marks_2 = pd.Series([9, 8, 9, 7, 5, np.nan], index=['Clarke', 'John', 'Mathew', 
                                          'Lily', 'Rose', 'James'])
pd.isna(marks_2)

Clarke    False
John      False
Mathew    False
Lily      False
Rose      False
James      True
dtype: bool

In [184]:
marks_2[marks_2.isna() == True]

James   NaN
dtype: float64

In [185]:
# We can label index
marks.index.name = "Name"
marks

Name
Clarke    9
John      8
Mathew    9
Lily      7
Rose      5
dtype: int64

# DataFrame

In [186]:
df = pd.DataFrame({'Marks': [12, 34, 56 ,13],
                  'Total Mark': [70, 70, 70, 70]},
                  index=['George', 'Hanna', 'Lissy', 'John'])
df

        Marks  Total Mark
George     12          70
Hanna      34          70
Lissy      56          70
John       13          70

In [187]:
# To get the column names
df.columns

Index(['Marks', 'Total Mark'], dtype='object')

In [188]:
# To get the element in a particula row and column
df['Marks']

George    12
Hanna     34
Lissy     56
John      13
Name: Marks, dtype: int64

In [189]:
df.loc['John', 'Marks']

13

In [190]:
df.iloc[2, 1]

70

In [191]:
# Head
df.head(2)

        Marks  Total Mark
George     12          70
Hanna      34          70

In [192]:
# Tail
df.tail(2)

       Marks  Total Mark
Lissy     56          70
John      13          70

In [193]:
# This is how we access elements of only some particular columns
df[['Marks', 'Total Mark']]

        Marks  Total Mark
George     12          70
Hanna      34          70
Lissy      56          70
John       13          70

In [194]:
# Adding a column
df['Student ID'] = np.arange(4)
df

        Marks  Total Mark  Student ID
George     12          70           0
Hanna      34          70           1
Lissy      56          70           2
John       13          70           3

In [195]:
# To find indices and replace
indices = df[df['Marks'] < 15]['Marks'].index
df.loc[indices, 'Marks'] = 'Failed'
df

         Marks  Total Mark  Student ID
George  Failed          70           0
Hanna       34          70           1
Lissy       56          70           2
John    Failed          70           3

KeyError: ignored